package homework1;

public class Транспорт {
    String назва;
    int швидкість;

    public void опис(String назва, int швидкість) {
        System.out.print("Назва - " +назва+". Максимальна швидкість - "+швидкість+"км/год.");
    }
}

class Автомобіль extends Транспорт {
    String тип_топлива;
    int кількість_пасажирів;
    public void опис(String назва, int швидкість, String тип_топлива, int кількість_пасажирів) {
        опис(назва, швидкість);
        System.out.println("Тип топлива - "+тип_топлива+". Кількість пасажирів - "+кількість_пасажирів+".");
    }
}

class Велосипед extends Транспорт {
    int кількість_передач;

    public void опис(String назва, int швидкість, int кількість_передач) {
        опис(назва, швидкість);
        System.out.println("Кількість передач - " +кількість_передач+".");
    }
}

